Revit 2024 API
Document.NewElbowFitting Method
Add a new family instance of an elbow fitting into the Autodesk Revit document, using two connectors.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilyInstance NewElbowFitting(
	Connector connector1,
	Connector connector2
)
Visual Basic
Public Function NewElbowFitting ( _
	connector1 As Connector, _
	connector2 As Connector _
) As FamilyInstance
Visual C++
public:
FamilyInstance^ NewElbowFitting(
	Connector^ connector1,
	Connector^ connector2
)
Parameters
connector1
Type: Autodesk.Revit.DB.Connector
The first connector to be connected to the elbow.
connector2
Type: Autodesk.Revit.DB.Connector
The second connector to be connected to the elbow.
Return Value
If creation was successful then an family instance to the new object is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument connector1 or connector2 is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the connectors cannot be used for the elbow creation. For example, they cannot be from the same element, they must be of the same domain, and the angle between them must fall within the valid range (typically 2 to 95 degrees).
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when an elbow fitting cannot be created because the angle between the two connectors is too large or too small, the connectors are not close enough together, or the connectors are placed at positions with too high of a tolerance.
See Also
Document Class
Autodesk.Revit.Creation Namespace